# Heading

## Heading 2

In [2]:
x=99
y=80

In [3]:
print("The value of x is :", x)

The value of x is : 99

In [1]:
x = 10
print(type(x))

<class 'int'>

In [10]:
print("Value of x is :" , x , "and value of y is :", y)

Value of x is : 99 and value of y is : 80

In [11]:
print("Value of x is : x and value of y is : y")

Value of x is : x and value of y is : y

In [13]:
print(f"Value of x is : {x} and value of y is : {y}")

Value of x is : 99 and value of y is : 80

In [18]:
a = 21
b = "Ee sala cupp namdu"
c = 10.99
d = False 
print(a , " is " , type(a))
print(b , " is " , type(b))
print(c , " is " , type(c))
print(d , " is " , type(d))

21  is  <class 'int'>
Ee sala cupp namdu  is  <class 'str'>
10.99  is  <class 'float'>
False  is  <class 'bool'>

In [22]:
a = 25
b = 7
print("Addition of a and b is : ", a+b)
print("Subtraction of a and b is : ", a-b)
print("Multiplication of a and b is : ", a*b)
print("Division of a and b is : ", a/b)
print("Reminder of a and b is : ", a%b)
print("Floor Division  of a and b is : ", a//b)
print("Exponention of a and b is : ", a**b)

Addition of a and b is :  32
Subtraction of a and b is :  18
Multiplication of a and b is :  175
Division of a and b is :  3.5714285714285716
Reminder of a and b is :  4
Floor Division  of a and b is :  3
Exponention of a and b is :  6103515625

In [27]:
a = 10
b = 20
print("Equal :" , a==b)
print("Not equal :" , a!=b)
print("Greater :" , a>b)
print("Lesser: " , a<b)
print("Greater or equal :" , a>=b)
print("Lesser or equa :l" , a<=b)

Equal : False
Not equal : True
Greater : False
Lesser:  True
Greater or equal : False
Lesser or equa :l True

In [28]:
a = 10
b = 20
a = a + b
print(a)

30

In [30]:
a = 25
b = 30
a += b   # (a = a + b) == (a += b)
print(a)

55

In [31]:
a = 21 
b = 11
a *= b   # (a = a * b) == (a *= b)
print(a)

231

In [13]:
x = True                                
y = False
z = False
print(x and y and z)
print(x or y or z)
print(not(x) , not(y) , not(z))
print(not(x and y and z))

False
True
False True True
True

In [17]:
a = "asdfghjkl"     #Membership Operator
print("f" in a)
print("f" not in a)
print("r" in a)

True
False
False

In [32]:
x = 10            #Identical Operator
y = x
print(x)
print(y)
print(x is y)
z = y
print(y is not z)

10
10
True
False
False

In [33]:
c = 10
print(x is c)

True

In [34]:
a = input("Enter a value")    #Bydefault datatype of the value is STRING when input is taken from the user
b = input("Enter a value")
print(a + b)   #Concatination

Enter a value45
Enter a value89
4589

In [35]:
a = int(input("Enter a value"))
b = int(input("Enter a value"))
print(a + b)

Enter a value67
Enter a value10
77

In [37]:
Age = int(input("Enter your age :"))
if (Age>=18):
    print("Your are eligible to apply for driving lisence")
else:
    print("Your are not eligible to apply for driving lisence")

Enter your age :15
Your are not eligible to apply for driving lisence

In [44]:
number = int(input("Enter number"))
if (number%2 == 0):
    print(" even")
else:
    print(" odd")

Enter number6
 even

In [50]:
num = int(input("Enter the value: "))
if (num>0):
    print("num is positive")
elif (num==0):
    print("num is zero")
else:
    print("num is negitive")

Enter the value: 70
num is positive

In [53]:
num = int(input("Enter the value: "))
if (num>=0):
    if (num==0):
        print("num is zero")
    else:
        print("positive")
else:
    print("negitive")

Enter the value: 3
positive

In [56]:
num1 = int(input("enter number: "))
num2 = int(input("enter number: "))
num3 = int(input("enter number: "))
if (num1 > num2 > num3):
    print("num1 is the largest number")
elif (num2 > num3):
    print("num2 is the largest number")
else:
    print("num3 is the largest number")

enter number: 70
enter number: 9
enter number: 7
num1 is the largest number

In [68]:
num1 = int(input("enter number: "))
num2 = int(input("enter number: "))
num3 = int(input("enter number: "))
if (num1 > num2 ):
    if(num1 > num3):
        print(num1,"is the largest number")
    else:
        print(num2,"is the largest number")
else:
    if (num3 > num2):
        print(num3,"largest number" )
    else:
        print(num2,"is largest")

enter number: 3
enter number: 4
enter number: 9
9 largest number

In [74]:
num = int(input("enter number: "))
if (num % 2 ==0 and num % 3 == 0):
    print(num,"is divisible by both 2 and 3")
elif(num % 2 !=0 and num % 3 == 0):
     print(num,"is divisible by 3 only")
elif (num % 2 ==0 and num % 3 != 0):
    print(num,"is divisible by 2 only")
else:
    print(num,"is not divisible by both 2 and 3 only")

enter number: 33
33 is divisible by 3 only

In [4]:
num = int(input("enter number: "))
if (num % 2 == 0):
    if(num % 3 == 0):
        print(num,"is divisible by 2 and 3")
    else:
        print(num,"is divisible by 2 only")
else:
    if (num % 3 == 0):
        print(num,"is divisible by 3 only")
    else:
        print(num,"is not divisible by 2 and 3")

enter number: 77
77 is not divisible by 2 and 3

In [3]:
a=10
while(a>=1):
    print(a)
    a-=1

10
9
8
7
6
5
4
3
2
1

In [2]:
a = 16
i = 1
while(i>=10):
    print(a * i)
    a+=1

In [3]:
a = int(input("enter a number"))
i = 1
while(i<=10):
    print(f"{a} * {i} =",a*i)
    i+=1

enter a number39
39 * 1 = 39
39 * 2 = 78
39 * 3 = 117
39 * 4 = 156
39 * 5 = 195
39 * 6 = 234
39 * 7 = 273
39 * 8 = 312
39 * 9 = 351
39 * 10 = 390

In [11]:
a = int(input("enter a number"))
start = int(input("enter starting point"))
end = int(input("enter ending point"))
i = start
while(i<=end):
    print(f"{a} * {i} =",a*i)
    i+=1

enter a number22
enter starting point11
enter ending point19
22 * 11 = 242
22 * 12 = 264
22 * 13 = 286
22 * 14 = 308
22 * 15 = 330
22 * 16 = 352
22 * 17 = 374
22 * 18 = 396
22 * 19 = 418

In [1]:
a = int(input("enter a number"))
start = int(input("enter starting point"))
end = int(input("enter ending point"))
i = start
if (i<end):
    while(i<=end):
        print(f"{a} * {i} =",a*i)
        i+=1
else:
    print("start point is greater than end point")

enter a number5
enter starting point2
enter ending point9
5 * 2 = 10
5 * 3 = 15
5 * 4 = 20
5 * 5 = 25
5 * 6 = 30
5 * 7 = 35
5 * 8 = 40
5 * 9 = 45

In [5]:
a = 1
while(a<=10):
    if(a==5):
        break
    print(a)
    a+=1
print("outside loop",a)

1
2
3
4
outside loop 5

In [8]:
a = 1
while(a<=10):
    if(a==7):
        a+=1
        continue
    print(a)
    a+=1

1
2
3
4
5
6
8
9
10

In [2]:
a = "asdfghjklzxcvbnm"
for i in a:
    print(i)

a
s
d
f
g
h
j
k
l
z
x
c
v
b
n
m

In [4]:
a = "asdfghjklzxcvbnm"
for i in a:
    print(i, end="")

asdfghjklzxcvbnm

In [10]:
a = "asdfghjklzxcvbnmaaaaaa"
vowel = "aeiouAEIOU"
count = 0
for i in a:
    if i in vowel:
        count+=1
print("total no of vowels in a are:",count)

total no of vowels in a are: 7

In [12]:
for i in range(10,20):
    print(i)

10
11
12
13
14
15
16
17
18
19

In [13]:
for i in range(20):  # Bydefault starting point is considered as 0
    print(i)

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19

In [15]:
for i in range(0,50,5):
    print(i)

0
5
10
15
20
25
30
35
40
45

In [18]:
start = int(input("enter number"))
end = int(input("enter number"))
diff = int(input("enter number"))
for i in range(start , end+1 , diff):
    print(i)

enter number10
enter number100
enter number10
10
20
30
40
50
60
70
80
90
100

In [2]:
start = int(input("enter number"))
end = int(input("enter number"))
for i in range(start , end+1):
    if i%5==0 and i%15==0:
        print(i)

enter number100
enter number200
105
120
135
150
165
180
195

In [27]:
x = []
print(type(x))
x = list()
print(x)

<class 'list'>
[]

In [26]:
x = list()
print(type(x))
print(x)

<class 'list'>
[]

In [31]:
List = [20,30,24,87,89]
print(List[3])

87

In [14]:
List = [20,30,24,87,89]
List.append(90)
print(List)
print(List[-2])
print(List[0:5])

[20, 30, 24, 87, 89, 90]
89
[20, 30, 24, 87, 89]

In [45]:
data = ["red", "blue", "orange", "yellow", "black"]
print(data[0:4])
print(data[0:5:2])
print(data[:5])
print(data[:])
print(data[1:])

['red', 'blue', 'orange', 'yellow']
['red', 'orange', 'black']
['red', 'blue', 'orange', 'yellow', 'black']
['red', 'blue', 'orange', 'yellow', 'black']
['blue', 'orange', 'yellow', 'black']

In [8]:
x = [2,3,4,4,5,6,7]   #Append 
x.append(8)
print(x)
x.append([9,10])
print(x)
print(x[8])
print(x[8][1])

[2, 3, 4, 4, 5, 6, 7, 8]
[2, 3, 4, 4, 5, 6, 7, 8, [9, 10]]
[9, 10]
10

In [17]:
x = [2,3,4,4,5,6,7]
x.insert(0,1)
print(x)

[1, 2, 3, 4, 4, 5, 6, 7]

In [18]:
data = ["red", "blue", "orange", "yellow", "black"]
data.insert(1,"green")
print(data)

['red', 'green', 'blue', 'orange', 'yellow', 'black']

In [21]:
data = ["red", "blue", "orange", "yellow", "black"]
x = [2,3,4,4,5,6,7]
data.extend(x)
print(data)

['red', 'blue', 'orange', 'yellow', 'black', 2, 3, 4, 4, 5, 6, 7]

In [2]:
data = ["red", "blue", "orange", "yellow", "black"]
data[1]="pink"
print(data)

['red', 'pink', 'orange', 'yellow', 'black']

In [3]:
data = ["red", "blue", "orange", "yellow", "black"]
print(data[1:4])

['blue', 'orange', 'yellow']

In [5]:
data[1:4] = ["voilet","lavender","grey","ash"]
print(data)

['red', 'voilet', 'lavender', 'grey', 'ash', 'black']

In [8]:
data = ["red", "blue", "orange", "yellow", "black"]
data.remove("blue")
print(data)

['red', 'orange', 'yellow', 'black']

In [10]:
numbers = [1,2,2,22,2,2,4,5]
for i in numbers:
    numbers.remove(2)
print(numbers)

[1, 22, 4, 5]

In [11]:
data = ["red", "blue", "orange", "yellow", "black"]
data.pop(2)
print(data)

['red', 'blue', 'yellow', 'black']

In [12]:
data.pop(-2)
print(data)

['red', 'blue', 'black']

In [16]:
nums = [3,3,3,1,2,3,3,3,4,5,6,7]
for i in nums:
    nums.remove(3)
print(nums)

[1, 2, 4, 5, 6, 7]

In [17]:
nums = [3,3,3,1,2,3,3,3,4,5,6,7]
for i in nums:
    nums.remove(3)
    print(nums)

[3, 3, 1, 2, 3, 3, 3, 4, 5, 6, 7]
[3, 1, 2, 3, 3, 3, 4, 5, 6, 7]
[1, 2, 3, 3, 3, 4, 5, 6, 7]
[1, 2, 3, 3, 4, 5, 6, 7]
[1, 2, 3, 4, 5, 6, 7]
[1, 2, 4, 5, 6, 7]

In [21]:
data = [1,3,4,5,66,44,45,40,24,67,10]
del data[2:6]
print(data)

[1, 3, 45, 40, 24, 67, 10]

In [22]:
data.clear()
print(data)

[]

In [23]:
data.append(89)
data.append(78)
print(data)

[89, 78]

In [26]:
del data
print(data)

NameError: name 'data' is not defined

In [4]:
var1 = [12,34,56,78]
print(var1)

[12, 34, 56, 78]

In [5]:
var2 = var1
var1.append("whynot175")
print(var2)

[12, 34, 56, 78, 'whynot175']

In [8]:
del var1
print(var2)
print(var1)

NameError: name 'var1' is not defined

In [9]:
print(var2)

[12, 34, 56, 78, 'whynot175']

In [12]:
data1 = ["sds","wer","wer","werty"]
data2 = data1.copy()
print(data2)
data1.pop(0)
print(data2)
print(data1)

['sds', 'wer', 'wer', 'werty']
['sds', 'wer', 'wer', 'werty']
['wer', 'wer', 'werty']

In [11]:
nums = [3,3,3,1,2,3,3,3,4,5,6,7]
print(min(nums))
print(max(nums))
print(sum(nums))
nums.sort()
print(nums)
nums.sort(reverse=True)
print(nums)
data = ["sds","wer","wer","werty"]
data.reverse()
print(data)

1
7
43
[1, 2, 3, 3, 3, 3, 3, 3, 4, 5, 6, 7]
[7, 6, 5, 4, 3, 3, 3, 3, 3, 3, 2, 1]
['werty', 'wer', 'wer', 'sds']

In [1]:
tuple1 = (1,2,3,4)
print(tuple1)
print(type(tuple1))

(1, 2, 3, 4)
<class 'tuple'>

In [8]:
tup = tuple()
print(tup)
print(type(tup))

()
<class 'tuple'>

In [10]:
tup1 = (22)
print(tup1)
print(type(tup1))

22
<class 'int'>

In [11]:
tup1 = (22,)
print(tup1)
print(type(tup1))

(22,)
<class 'tuple'>

In [13]:
tup2 = 34,56,78,"abcd"
print(tup2)
print(type(tup2))

(34, 56, 78, 'abcd')
<class 'tuple'>

In [2]:
data = (21,44,56,76,75,89,89)
print(data[0])
print(data[-2])
print(data[1:4])
print(data)

21
89
(44, 56, 76)
(21, 44, 56, 76, 75, 89, 89)

In [12]:
data1 = (23,41,67,84,10)
temp = list(data1)
print(temp)
print(type(temp))
temp.insert(1,410)
print(temp)
data1 = tuple(temp)
print(data1)

[23, 41, 67, 84, 10]
<class 'list'>
[23, 410, 41, 67, 84, 10]
(23, 410, 41, 67, 84, 10)

In [17]:
values = (100,200,400,500,600)
temp1 = list(values)
print(temp1)
temp1.insert(2,300)
values = tuple(temp1)
print(values)
print(type(values))

[100, 200, 400, 500, 600]
(100, 200, 300, 400, 500, 600)
<class 'tuple'>

In [5]:
#packaging and unpackaging
data = 1,"asdf",90.99
print(data)
s_no,name,marks=data
print(s_no)
print(name)
print(marks)

(1, 'asdf', 90.99)
1
asdf
90.99

In [6]:
marks+=9
print(marks)

99.99

In [9]:
data = 1,"asdf",90.99,"asdfghm",800,"xcvbn"
s_no,name,marks=data
print(s_no)
print(name)
print(marks)

ValueError: too many values to unpack (expected 3)

In [10]:
data = 1,"asdf",90.99,"asdfghm",800,"xcvbn"
s_no,name,marks,*remaining=data
print(s_no)
print(name)
print(marks)
print(remaining)

1
asdf
90.99
['asdfghm', 800, 'xcvbn']

In [11]:
values = (100,200,400,500,600)
print(min(values))
print(max(values))

100
600

In [12]:
set1 = {}
print(set1)
print(type(set1))

{}
<class 'dict'>

In [14]:
set1 = set()
print(set1)
print(type(set1))

set()
<class 'set'>

In [15]:
set3 = {23,56,7,89,65,"wert",990}
print(set3)

{65, 23, 7, 56, 89, 'wert', 990}

In [18]:
set4 = {23,23,23,45,67,45,89,67,99,121,34,45}
print(set4)

{121, 34, 67, 99, 23, 89, 45}
{121, 34, 67, 99, 23, 89, 45}

In [20]:
set4.add(50)
print(set4)
set4.add(67)
print(set4)

{121, 34, 67, 99, 50, 23, 89, 45}
{121, 34, 67, 99, 50, 23, 89, 45}

In [6]:
set4 = {23,23,23,45,67,45,89,67,99,121,34,45}
set4.update([50,100,1000])
print(set4)

{67, 23, 89, 34, 99, 100, 1000, 45, 50, 121}

In [7]:
set4.remove(90000)
print(set4)

KeyError: 90000

In [3]:
set4 = {23,23,23,45,67,45,89,67,99,121,34,45}
set4.discard(90000)
print(set4)

{121, 34, 67, 99, 23, 89, 45}

In [4]:
set4 = {23,23,23,45,67,45,89,67,99,121,34,45}
set4.remove(67)
set4.remove(99)
print(set4)

{121, 34, 23, 89, 45}

In [1]:
set5 = {23,23,23,45,67,45,89,67,99,121,34,45}
set5.clear()
print(set5)

set()

In [4]:
set5.add(8)
print(set5)
set5.add(80)
print(set5)

{8}
{8, 80}

In [6]:
del set5
print(set5)

NameError: name 'set5' is not defined

In [7]:
data = {22,33,42,57,87}
print(data)
print(type(data))

{33, 22, 87, 57, 42}
<class 'set'>

In [8]:
data.add(98)
print(data)

{33, 98, 22, 87, 57, 42}

In [10]:
data1 = (27,89,65,90,21,44,56)     #Frozen set = set which is immutable
data2 = frozenset(data1)
print(data2)
print(type(data2))

frozenset({65, 44, 21, 56, 89, 90, 27})
<class 'frozenset'>

In [11]:
data2.add(478)
print(data2)

AttributeError: 'frozenset' object has no attribute 'add'

In [19]:
dictionary = {
    "sn0" : 1,
    "name" : "asdf",
    "age" : 21
}
print(dictionary)
print(type(dictionary))

{'sn0': 1, 'name': 'asdf', 'age': 21}
<class 'dict'>

In [2]:
students = {                #index value is unique
    "s1"  : "Jaiswal",
    "s2" : "KL",
    "s3" : "Sudarshan",
    "s4" : "Gill",
    "s3" : "Nair"
}
print(students)

{'s1': 'Jaiswal', 's2': 'KL', 's3': 'Nair', 's4': 'Gill'}

In [18]:
players = {             #values can be duplicate
    "s1" : "Gill",
    "s2" : "Gill",
    "s3" : "Gill",
    "s4" : "Gill"
}
print(players)
print(players.get("s2"))

{'s1': 'Gill', 's2': 'Gill', 's3': 'Gill', 's4': 'Gill'}
Gill

In [1]:
students1 = {                #index value is unique
    "s1"  : "Jaiswal",
    "s2" : "KL",
    "s3" : "Sudarshan",
    "s4" : "Gill",
    "s5" : "Nair"
}
print(students1)
print(students1["s1"])
print(students1.get("s5"))

{'s1': 'Jaiswal', 's2': 'KL', 's3': 'Sudarshan', 's4': 'Gill', 's5': 'Nair'}
Jaiswal
Nair

In [2]:
color = {
    "c1" : "red",
    "c2" : "yellow",
    "c3" : "orange",
    "c4" : "green",
    "c5" : "white"
}
print(color)

{'c1': 'red', 'c2': 'yellow', 'c3': 'orange', 'c4': 'green', 'c5': 'white'}

In [4]:
color["c1"]="gold"
print(color)

{'c1': 'gold', 'c2': 'yellow', 'c3': 'orange', 'c4': 'green', 'c5': 'white'}

In [5]:
color["c6"]="blue"
print(color)

{'c1': 'gold', 'c2': 'yellow', 'c3': 'orange', 'c4': 'green', 'c5': 'white', 'c6': 'blue'}

In [6]:
color.update({"c2":"voilet" , "c7":"purple"})
print(color)

{'c1': 'gold', 'c2': 'voilet', 'c3': 'orange', 'c4': 'green', 'c5': 'white', 'c6': 'blue', 'c7': 'purple'}

In [7]:
color.setdefault("c1","silver")
print(color)

{'c1': 'gold', 'c2': 'voilet', 'c3': 'orange', 'c4': 'green', 'c5': 'white', 'c6': 'blue', 'c7': 'purple'}

In [8]:
color.setdefault("c8","silver")
print(color)

{'c1': 'gold', 'c2': 'voilet', 'c3': 'orange', 'c4': 'green', 'c5': 'white', 'c6': 'blue', 'c7': 'purple', 'c8': 'silver'}

In [9]:
color.pop("c1")
print(color)

{'c2': 'voilet', 'c3': 'orange', 'c4': 'green', 'c5': 'white', 'c6': 'blue', 'c7': 'purple', 'c8': 'silver'}

In [10]:
color.popitem("c1")
print(color)

TypeError: dict.popitem() takes no arguments (1 given)

In [12]:
color.popitem()    #removes last element bydefault
print(color)

{'c2': 'voilet', 'c3': 'orange', 'c4': 'green', 'c5': 'white', 'c6': 'blue', 'c7': 'purple'}

In [15]:
studentss = {                #index value is unique
    "s1"  : "Jaiswal",
    "s2" : "KL",
    "s3" : "Sudarshan",
    "s4" : "Gill",
    "s3" : "Nair"
}
print(studentss)

{'s1': 'Jaiswal', 's2': 'KL', 's3': 'Nair', 's4': 'Gill'}

In [16]:
studentss.clear()
print(studentss)

{}

In [21]:
studentss["s1"]="Rohith"
print(studentss)
print("=======================================")
studentss.update({"s2":"Virat","s1":"Pujara"})
studentss.setdefault("s3","Rahane")
print(studentss)

{'s1': 'Rohith', 's2': 'Virat', 's3': 'Rahane'}
=======================================
{'s1': 'Pujara', 's2': 'Virat', 's3': 'Rahane'}

In [22]:
del studentss["s3"]
print(studentss)

{'s1': 'Pujara', 's2': 'Virat'}

In [23]:
del studentss
print(studentss)

NameError: name 'studentss' is not defined

In [25]:
cricketers = {                #index value is unique
    "s1"  : "Jaiswal",
    "s2" : "KL",
    "s3" : "Sudarshan",
    "s4" : "Gill",
    "s3" : "Nair"
}
print(cricketers)

{'s1': 'Jaiswal', 's2': 'KL', 's3': 'Nair', 's4': 'Gill'}

In [26]:
print(cricketers.keys())
print(cricketers.values())
print(cricketers.items())

dict_keys(['s1', 's2', 's3', 's4'])
dict_values(['Jaiswal', 'KL', 'Nair', 'Gill'])
dict_items([('s1', 'Jaiswal'), ('s2', 'KL'), ('s3', 'Nair'), ('s4', 'Gill')])

In [2]:
def function():
    print("hello")       #Function with no parameter and no return value
    print("hi")
    print("bye")

In [3]:
function()

hello
hi
bye

In [6]:
for i in range(5,10):
    function()

hello
hi
bye
hello
hi
bye
hello
hi
bye
hello
hi
bye
hello
hi
bye

In [2]:
def greeting(name):
    print("hello",name,",how are you?")       #Function with a parameter and no return value

In [3]:
greeting("tarun")

hello tarun ,how are you?

In [9]:
def functions(number):
    print("highest score in this match is ",number)

In [12]:
functions(100)

highest score in this match is  100

In [32]:
def adding():                           #Function without a parameter and with a return value
    a = int(input("enter a value:"))
    b = int(input("enter a value:"))    #store the function in a varible when we are returning a value and no parameter
    c = a + b
    return c

In [33]:
adding()

enter a value:5
enter a value:90

95

In [35]:
sums = adding()
print(sums)

enter a value:60
enter a value:90
150

In [36]:
sums+=10
print(sums)

160

In [37]:
def cal(a,b):       #Function with a parameter and with a return value
    c = a + b
    return c

In [44]:
a = 56
b = 100
data = cal(a,b)
print(data)

156

In [45]:
cal(45,50)   #not prefered in this method

95

In [46]:
def cals(a,b):      
    c = a + b
    d = a - b
    e = a * b
    f = a / b
    g = a % b
    return c,d,e,f,g

In [47]:
data = cals(2,10)
print(data)

(12, -8, 20, 0.2, 2)

In [49]:
a = int(input("enter a value:"))
b = int(input("enter a value:"))
data1 = cals(a,b)
print(data1)

enter a value:60
enter a value:800
(860, -740, 48000, 0.075, 60)

In [50]:
cals(2,3)

(5, -1, 6, 0.6666666666666666, 2)

In [52]:
add , sub , mul , div , mod = cals(50,100)
print(add)
print(sub)
print(mul)
print(div)
print(mod)

150
-50
5000
0.5
50

In [4]:
def evenorodd(a):
    if(a%2==0):
        print("even")
    else:
        print("odd")
    return a

In [5]:
data = evenorodd(50)
print(data)

even
50

In [4]:
def checkevenorodd(a):
    if(a%2==0):
        return "even"
    else:
        return "odd"
    return a

In [5]:
data = checkevenorodd(99)
print(data)

odd

In [2]:
def myfun(l1):
    ecount = 0
    ocount = 0
    for x in l1:
        if x%2==0:
            ecount+=1
        else:
            ocount+=1
    return ecount , ocount

In [3]:
data = [22,67,89,90,56,88,100]
myfun(data)

(5, 2)

In [6]:
def fun2(l1):
    d = []
    for x in l1:
        if x%2==0:
            d.append(x)
    return len(d)

In [7]:
data = [22,67,89,90,56,88,100]
fun2(data)

5

In [6]:
fp1 = open("ReadingData.txt","r")
print("data")

data

In [11]:
fp = open(r"C:\Users\padal\OneDrive\Desktop\WDD\teamIndia..txt","r")
print(fp.read())
fp.close()
print("file is closed")

Jaiswal
Rahul
Sudarshan
Gill
Pant
Nair
Jadeja
Nitesh
Akashdeep
Siraj
Prasidh
file is closed

In [12]:
with open(r"C:\Users\padal\OneDrive\Desktop\WDD\teamIndia..txt","r") as x:
    print(x.read()) #There is no need to use close() when this method is used

Jaiswal
Rahul
Sudarshan
Gill
Pant
Nair
Jadeja
Nitesh
Akashdeep
Siraj
Prasidh

In [14]:
fp = open(r"ReadingData.txt","r")
print(fp.read())

hello hello hello hello

In [10]:
fp = open(r"ReadingData.txt","r")
data1 = fp.readline()
print(data1)
data2 = fp.readline()
print(data2)
data3 = fp.readline()
print(data3)
data4 = fp.readline()
print(data4)
data5 = fp.readline()
print(data5)

ohny, Johny,



Yes papa?



Eating sugar?

In [12]:
fp = open(r"ReadingData.txt","r")  #using this method data is printed in the form of list
print(fp.readlines())

['ohny, Johny,\n', '\n', 'Yes papa?\n', '\n', 'Eating sugar?\n', '\n', 'No papa.\n', '\n', 'Telling lies?\n', '\n', 'No papa.\n', '\n', 'Open your mouth\n', '\n', 'Ha ha ha!\n']

In [15]:
data = ("hello hello hello hello")
fp = open(r"ReadingData.txt","w")
fp.write(data)

23

In [18]:
fp = open(r"ReadingData.txt","w+")     #to write and read data at same time use "+"
fp.write(data)
fp.seek(0)
print(fp.read())

hello hello hello hello

In [25]:
data1 = ("\nhi hi hi hi hi")
fp = open("ReadingData.txt","a+")
fp.write(data1)
fp.seek(0)
print(fp.read())

hello hello hello hellohi hi hi hi hihi hi hi hi hi/n/nhi hi hi hi hihi hi hi hi hi
hi hi hi hi hi
hi hi hi hi hi

In [29]:
data4 = ['ohny, Johny,\n', '\n', 'Yes papa?\n', '\n', 'Eating sugar?\n', '\n', 'No papa.\n', '\n', 'Telling lies?\n', '\n', 'No papa.\n', '\n', 'Open your mouth\n', '\n', 'Ha ha ha!\n']
fp = open("ReadingData.txt","a+")
fp.writelines(data4)
fp.seek(0)
print(fp.read())

hello hello hello hellohi hi hi hi hihi hi hi hi hi/n/nhi hi hi hi hihi hi hi hi hi
hi hi hi hi hi
hi hi hi hi hihello hello hello hello
ohny, Johny,

Yes papa?

Eating sugar?

No papa.

Telling lies?

No papa.

Open your mouth

Ha ha ha!
ohny, Johny,

Yes papa?

Eating sugar?

No papa.

Telling lies?

No papa.

Open your mouth

Ha ha ha!

In [30]:
a = 10
b = 0
c = a/b
print(c)

ZeroDivisionError: division by zero

In [31]:
try:               #Exception Handling
    a = 10
    b = 0
    c = a/b
    print(c)
except:
    print("contact admin")

contact admin

In [32]:
try:               #Exception Handling
    a = 10
    b = 0
    c = a/b
    print(c)
except ZeroDivisionError:
    print("zero division error")
except IndexError:
    print("index error")
except:
    print("contact admin")

zero division error

In [34]:
try:               #Exception Handling
    x = [20,30,40,50,60]
    print(x[20])
except ZeroDivisionError:
    print("zero division error")
except IndexError:
    print("index error")
except:
    print("contact admin")

index error

In [36]:
try:               #Exception Handling
    x = [20,30,40,50,60]
    print(x(3))
except ZeroDivisionError:
    print("zero division error")
except IndexError:
    print("index error")
except:  #Universal Exceptor
    print("contact admin")

contact admin

In [37]:
try:
    a = 10
    b = "20"
    c = a + b
except:
    print("Error is detected")
else:
    print("asnwer is ",c)
finally:
    print("kya farak padtha hai!")

Error is detected
kya farak padtha hai!

In [38]:
try:
    a = 10
    b = 20
    c = a + b
except:
    print("Error is detected")
else:                            #else block is executed when try block do not have any errors
    print("asnwer is ",c)
finally:
    print("kya farak padtha hai!")

asnwer is  30
kya farak padtha hai!

In [39]:
class student:
    name = "Tarun"
    age = "21"

In [41]:
x = student()          #Class is a user defined data type in python
print(x.name)
print(x.age)

Tarun
21

In [46]:
class test:
    def __init__(self):      #constructor
        print("game on")     #self is a widely used parameter in the industry and is not a keyword
    def fun(self):
        print("game off")

In [44]:
x1 = test()

game on

In [45]:
x1.fun()

game off

In [47]:
class test1:
    def __init__(self):
        print("game on")
    def fun1():
        print("game off")

In [48]:
x = test1()

game on

In [49]:
x.fun1()         #without a parameter in function in a class , block cannot be executed

TypeError: fun1() takes 0 positional arguments but 1 was given

In [1]:
class student:
    name = "Tarun"
    age = "21"

In [2]:
x = student()          #Class is a user defined data type in python
print(x.name)
print(x.age)

Tarun
21

In [5]:
y = student()          #Class is a user defined data type in python
print(y.name)
print(y.age)

Tarun
21

In [63]:
class students:
    def __init__(self,name,age):
        self.name = name
        self.age = age
    def details(self):
        print(f"name of the student is {self.name} and age is {self.age}")

In [64]:
y = students("Jaiswal",22)
z = students("Sudarshan",23)

In [65]:
y.details()
print("===================================================")
z.details()

name of the student is Jaiswal and age is 22
===================================================
name of the student is Sudarshan and age is 23

In [3]:
class clas():
    def __init__(self):
        print("Activated")
    def fun(self):
        print("Running")
    def __del__(self):
        print("Deactivated")

In [10]:
x1 = clas()

Activated

In [11]:
x1.fun()

Running

In [12]:
del x1

Deactivated

In [33]:
class parent():
    def vechile(self):
        print("vechiles")

In [34]:
class child(parent):
    def car(self):
        print("cars")

In [35]:
x1 = child()
x1.vechile()

vechiles

In [55]:
class clas():
    def __init__(self):
        print("Activated")
    def fun(self):
        print("Running")

In [58]:
class test1(clas):
    def __init__(self):
        super().__init__
        print("game on")
    def fun1(self):
        print("game off")

In [60]:
x1 = test1()
x1.fun1()
x1.fun()
x1 = clas()

game on
game off
Running
Activated

In [83]:
class samsung():
    company = "samsung"
    website = "www.samsung.com"
    def detail_info(self):
        print("samsung is one of the oldest and leading company in tech industry")

In [84]:
class samsung1223(samsung):
    def __init__(self,name,price):
        self.name = name
        self.price = price
    def user_info(self):
        print(f"name of customer is {self.name}\n price of the product is {self.price}")
        print(f"Brand name is {self.company} \n website is {self.website}")

In [85]:
x1 = samsung1223("Tarun",20000)

In [86]:
x1.detail_info()
x1.user_info()

samsung is one of the oldest and leading company in tech industry
name of customer is Tarun
 price of the product is 20000
Brand name is samsung
 website is www.samsung.com

In [1]:
class mother():
    def commerce(self):
        print("Mother is expert in commerce")

In [2]:
class father():
    def accounts(self):
        print("father is expert in accounts")

In [6]:
class child(mother,father):
    def sports(self,game):
        print("Child is expert in sports, especially in",game)

In [8]:
x1 = child()

In [9]:
x1.commerce()
x1.accounts()
x1.sports("cricket")

Mother is expert in commerce
father is expert in accounts
Child is expert in sports, especially in cricket

In [23]:
class person():
    def personnel_info(self,name,age,gender):
        print(f"personnel_info\nName : {name}\nAge : {age}\nGender : {gender}")

In [21]:
class company():
    def company_info(self,C_name,est,domain):
        print(f"company_info\nC_name : {C_name}\nest : {est}\ndomain: {domain}")

In [27]:
class employee(person,company):
    def employee_info(self,E_name,salary,profile):
        print(f"company_info\nE_name : {E_name}\nsalary : {salary}\nprofile: {profile}")

In [28]:
x = employee()

In [30]:
x.personnel_info("TArun",21,"Male")
x.company_info("samsung",50,"tech")
x.employee_info("sa445566",50000,"developer")

personnel_info
Name : TArun
Age : 21
Gender : Male
company_info
C_name : samsung
est : 50
domain: tech
company_info
E_name : sa445566
salary : 50000
profile: developer

# Pandas

In [30]:
import pandas as pd

In [31]:
data = ["Apple","Banana","Papaya","Mango"]
pd.Series(data)

0     Apple
1    Banana
2    Papaya
3     Mango
dtype: object

In [32]:
pd.Series(data,index=["F1","F2","F3","F4"])

F1     Apple
F2    Banana
F3    Papaya
F4     Mango
dtype: object

In [27]:
pd.Series(data,index=["F1","F2","F3"])

ValueError: Length of values (4) does not match length of index (3)

In [33]:
pd.Series(data,index=[1,2,3,4])

1     Apple
2    Banana
3    Papaya
4     Mango
dtype: object

In [34]:
data = {1 : "Apple", 2 : "Banana", 3 :"Papaya", 4 : "Mango"}
pd.Series(data)

1     Apple
2    Banana
3    Papaya
4     Mango
dtype: object

In [35]:
data1 = {"Name" : ["Tarun","Sai","Krishna","Murthy"],
       "Age" : [20, 21,22,23],
       "Height" : [170,171,172,173]}

In [41]:
df = pd.DataFrame(data1,index=["a","b","c","d"])
df

      Name  Age  Height
a    Tarun   20     170
b      Sai   21     171
c  Krishna   22     172
d   Murthy   23     173

In [37]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [43]:
df.loc["a"]

Name      Tarun
Age          20
Height      170
Name: a, dtype: object

In [46]:
df.loc["c",["Name","Age"]]

Name    Krishna
Age          22
Name: c, dtype: object

In [47]:
df.loc["a":"c"]

      Name  Age  Height
a    Tarun   20     170
b      Sai   21     171
c  Krishna   22     172

In [48]:
df.loc["a":"c",["Name"]]

      Name
a    Tarun
b      Sai
c  Krishna

In [51]:
data1 = {"Name" : ["Tarun","Sai","Krishna","Murthy"],
       "Age" : [20, 21,22,23],
       "Height" : [170,171,172,173],
       "Location" : ["Hyd","Blr","Mum","Chen"]}

In [54]:
df = pd.DataFrame(data1)
df

      Name  Age  Height Location
0    Tarun   20     170      Hyd
1      Sai   21     171      Blr
2  Krishna   22     172      Mum
3   Murthy   23     173     Chen

In [55]:
df.iloc[0]

Name        Tarun
Age            20
Height        170
Location      Hyd
Name: 0, dtype: object

In [57]:
df.iloc[0:2,1:4]

   Age  Height Location
0   20     170      Hyd
1   21     171      Blr

In [59]:
df.iloc[0:2,1:4]

   Age  Height Location
0   20     170      Hyd
1   21     171      Blr

In [68]:
df.iloc[:,0:1]

      Name
0    Tarun
1      Sai
2  Krishna
3   Murthy

In [67]:
df.iloc[:,1:2]

   Age
0   20
1   21
2   22
3   23

In [70]:
df.iloc[:,2:3]

   Height
0     170
1     171
2     172
3     173

In [71]:
df["Gender"] = ["M","M","M","M"]
df

      Name  Age  Height Location Gender
0    Tarun   20     170      Hyd      M
1      Sai   21     171      Blr      M
2  Krishna   22     172      Mum      M
3   Murthy   23     173     Chen      M

In [76]:
df.insert(1,"Contacts" , [1234,3456,9087,6784])
df

      Name  Contacts  Age  Height Location Gender        4 Contact
0    Tarun      1234   20     170      Hyd      M  Contact    1234
1      Sai      3456   21     171      Blr      M  Contact    3456
2  Krishna      9087   22     172      Mum      M  Contact    9087
3   Murthy      6784   23     173     Chen      M  Contact    6784

In [85]:
df

      Name  Contacts  Age  Height Location Gender        4
0    Tarun      1234   20     170      Hyd      M  Contact
1      Sai      3456   21     171      Blr      M  Contact
2  Krishna      9087   22     172      Mum      M  Contact
3   Murthy      6784   23     173     Chen      M  Contact

In [87]:
del df[4]

In [88]:
df

      Name  Contacts  Age  Height Location Gender
0    Tarun      1234   20     170      Hyd      M
1      Sai      3456   21     171      Blr      M
2  Krishna      9087   22     172      Mum      M
3   Murthy      6784   23     173     Chen      M

In [91]:
#Addind rows
df.loc[4]=["Padala",4568,25,167,"Pune","M"]
df

      Name  Contacts  Age  Height Location Gender
0    Tarun      1234   20     170      Hyd      M
1      Sai      3456   21     171      Blr      M
2  Krishna      9087   22     172      Mum      M
3   Murthy      6784   23     173     Chen      M
4   Padala      4568   25     167     Pune      M

In [93]:
data2 = {"Name" : ["Gill","Jaiswal"],
       "Age" : [25, 24],
       "Height" : [170,171],
       "Location" : ["Hyd","Blr"]}
df2 = pd.DataFrame(data2)
df2

      Name  Age  Height Location
0     Gill   25     170      Hyd
1  Jaiswal   24     171      Blr

In [103]:
df = pd.concat([df,df2],ignore_index=True)
df

       Name  Age  Height Location  Contacts Gender
0      Gill   25     170      Hyd       NaN    NaN
1   Jaiswal   24     171      Blr       NaN    NaN
2     Tarun   20     170      Hyd    1234.0      M
3       Sai   21     171      Blr    3456.0      M
4   Krishna   22     172      Mum    9087.0      M
5    Murthy   23     173     Chen    6784.0      M
6    Padala   25     167     Pune    4568.0      M
7      Gill   25     170      Hyd       NaN    NaN
8   Jaiswal   24     171      Blr       NaN    NaN
9      Gill   25     170      Hyd       NaN    NaN
10  Jaiswal   24     171      Blr       NaN    NaN
11     Gill   25     170      Hyd       NaN    NaN
12  Jaiswal   24     171      Blr       NaN    NaN

In [112]:
df = df.drop(1)
df

       Name  Age  Height Location  Contacts Gender
2     Tarun   20     170      Hyd    1234.0      M
3       Sai   21     171      Blr    3456.0      M
4   Krishna   22     172      Mum    9087.0      M
5    Murthy   23     173     Chen    6784.0      M
6    Padala   25     167     Pune    4568.0      M
7      Gill   25     170      Hyd       NaN    NaN
8   Jaiswal   24     171      Blr       NaN    NaN
9      Gill   25     170      Hyd       NaN    NaN
10  Jaiswal   24     171      Blr       NaN    NaN
11     Gill   25     170      Hyd       NaN    NaN
12  Jaiswal   24     171      Blr       NaN    NaN

In [113]:
df = pd.concat([df],ignore_index=True)
df

       Name  Age  Height Location  Contacts Gender
0     Tarun   20     170      Hyd    1234.0      M
1       Sai   21     171      Blr    3456.0      M
2   Krishna   22     172      Mum    9087.0      M
3    Murthy   23     173     Chen    6784.0      M
4    Padala   25     167     Pune    4568.0      M
5      Gill   25     170      Hyd       NaN    NaN
6   Jaiswal   24     171      Blr       NaN    NaN
7      Gill   25     170      Hyd       NaN    NaN
8   Jaiswal   24     171      Blr       NaN    NaN
9      Gill   25     170      Hyd       NaN    NaN
10  Jaiswal   24     171      Blr       NaN    NaN